using System.Xml.Linq;

namespace Sandbox
{
    public class Program
    {
        // ToDo создай иерархию классов для животных,
        // каждое животное должно иметь какой то цвет шерсти и уметь представлять себя
        // (описывая в консоль инфу про свой цвет шерсти и свое имя)
        // По итогу у тебя будет общий класс животные с методом Print (или вроде того), который умеет выводит в консоль
        // Несколько разных классов для разных типов животных (2-3 класса), которые будут НАСЛЕДОВАТЬ (ч4 метанит)
        // функционал общего класса животные
        // Создай несколько обьектов разных классов животных, пусть они о себе в консоль скажут что нибудь
        public static void Main()
        {
            
        }
    }
}