namespace Sandbox;

public class Service
{
    // ToDo Задачка про логгер
    // 1.  Реализовать логгер, который пишет информацию в файл и использовать его в сервисе
    // 2.  Реализовать логгер, который пишет информацию в консоль
    // 3.  Как сделать так, чтобы можно было использовать то один логгер, то другой без изменения кода в классе Service
    // 4.  Как сделать так, чтобы можно было логировать информацию и в консоль и в файл одновременно
    
    public Service()
    {
        
    }

    public void SomeMethod()
    {
        var sum = 2 + 2;
        // Здесь вызов логгера с текстом (Вооооу я сложил 2 + 2)
    }
}